jadhavrohit924/connectedhomeip/src/platform/ESP32/OTAImageProcessorImpl.cpp
    err = esp_delta_ota_deinit(imageProcessor->mDeltaOTAUpdateHandle);
    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "esp_delta_ota_deinit() failed (%s)!", esp_err_to_name(err));
        esp_ota_abort(imageProcessor->mOTAUpdateHandle);
        imageProcessor->ReleaseBlock();
        PostOTAStateChangeEvent(DeviceLayer::kOtaDownloadFailed);
    }

    err = esp_ota_end(imageProcessor->mOTAUpdateHandle);
    DeltaOTACleanUp(reinterpret_cast<intptr_t>(imageProcessor));
#elif defined(CONFIG_AUTO_UPDATE_RCP) && defined(CONFIG_OPENTHREAD_BORDER_ROUTER)
    esp_err_t err = esp_rcp_ota_end(imageProcessor->mRcpOtaHandle);
    err |= esp_ota_end(imageProcessor->mOTAUpdateHandle);
    imageProcessor->mRcpOtaHandle          = 0;
    imageProcessor->mBrFirmwareSize        = 0;
    imageProcessor->mRcpFirmwareDownloaded = false;
#else
    esp_err_t err = esp_ota_end(imageProcessor->mOTAUpdateHandle);
#endif // CONFIG_ENABLE_DELTA_OTA
    if (err != ESP_OK)
    {
        if (err == ESP_ERR_OTA_VALIDATE_FAILED)
        {
            ESP_LOGE(TAG, "Image validation failed, image is corrupted");
        }
        else
        {
            ESP_LOGE(TAG, "esp_ota_end failed (%s)!", esp_err_to_name(err));
        }
    }
    else
    {
        ChipLogProgress(SoftwareUpdate, "OTA image downloaded to offset 0x%" PRIx32, imageProcessor->mOTAUpdatePartition->address);
        otaState = DeviceLayer::kOtaDownloadComplete;
    }

    imageProcessor->ReleaseBlock();
    PostOTAStateChangeEvent(otaState);

    // Notify the dummy device that OTA is complete
    if (gOTAStarted)
    {
        DeviceOTAHandler* handler = OTAManager::GetInstance().GetOTAHandler(DUMMY_DEVICE_ID);
        if (handler != nullptr)
        {
            handler->OnOTAComplete();
            gOTAStarted = false; // Reset for next OTA
            ESP_LOGI(TAG, "Notified device %" PRIu32 " of OTA completion", DUMMY_DEVICE_ID);
        }
    }
}

void OTAImageProcessorImpl::HandleAbort(intptr_t context)
{
    auto * imageProcessor = reinterpret_cast<OTAImageProcessorImpl *>(context);
    if (imageProcessor == nullptr)
    {
        ChipLogError(SoftwareUpdate, "ImageProcessor context is null");
        return;
    }

#ifdef CONFIG_ENABLE_ENCRYPTED_OTA
    imageProcessor->DecryptAbort();
#endif // CONFIG_ENABLE_ENCRYPTED_OTA

#ifdef CONFIG_ENABLE_DELTA_OTA
    DeltaOTACleanUp(reinterpret_cast<intptr_t>(imageProcessor));
#endif // CONFIG_ENABLE_DELTA_OTA

#if defined(CONFIG_AUTO_UPDATE_RCP) && defined(CONFIG_OPENTHREAD_BORDER_ROUTER)
    if (esp_rcp_ota_abort(imageProcessor->mRcpOtaHandle) != ESP_OK)
    {
        ESP_LOGE(TAG, "ESP RCP OTA abort failed");
    }
    imageProcessor->mRcpOtaHandle          = 0;
    imageProcessor->mBrFirmwareSize        = 0;
    imageProcessor->mRcpFirmwareDownloaded = false;
#endif

    if (esp_ota_abort(imageProcessor->mOTAUpdateHandle) != ESP_OK)
    {
        ESP_LOGE(TAG, "ESP OTA abort failed");
    }
    imageProcessor->ReleaseBlock();
    PostOTAStateChangeEvent(DeviceLayer::kOtaDownloadAborted);
}

void OTAImageProcessorImpl::HandleProcessBlock(intptr_t context)
{
    auto * imageProcessor = reinterpret_cast<OTAImageProcessorImpl *>(context);
    if (imageProcessor == nullptr)
    {
        ChipLogError(SoftwareUpdate, "ImageProcessor context is null");
        return;
    }
    else if (imageProcessor->mDownloader == nullptr)
    {
        ChipLogError(SoftwareUpdate, "mDownloader is null");
        return;
    }

    ByteSpan block = ByteSpan(imageProcessor->mBlock.data(), imageProcessor->mBlock.size());

    CHIP_ERROR error = imageProcessor->ProcessHeader(block);
    if (error != CHIP_NO_ERROR)
    {
        ESP_LOGE(TAG, "Failed to process OTA image header");
        imageProcessor->mDownloader->EndDownload(error);
        PostOTAStateChangeEvent(DeviceLayer::kOtaDownloadFailed);
        return;
    }

    esp_err_t err;
    ByteSpan blockToWrite = block;

#ifdef CONFIG_ENABLE_ENCRYPTED_OTA
    error = imageProcessor->DecryptBlock(block, blockToWrite);
    if (error != CHIP_NO_ERROR)
    {
        ChipLogError(SoftwareUpdate, "esp_encrypted_img_decrypt_data failed err:%d", err);
        imageProcessor->mDownloader->EndDownload(CHIP_ERROR_WRITE_FAILED);
        PostOTAStateChangeEvent(DeviceLayer::kOtaDownloadFailed);
        return;
    }
#endif // CONFIG_ENABLE_ENCRYPTED_OTA

#ifdef CONFIG_ENABLE_DELTA_OTA

    int index = 0;
    err       = imageProcessor->VerifyHeaderData(blockToWrite.data(), blockToWrite.size(), &index);

    if (err != ESP_OK)
    {
        ESP_LOGE(TAG, "Header data verification failed (%s)", esp_err_to_name(err));
        imageProcessor->mDownloader->EndDownload(CHIP_ERROR_INVALID_SIGNATURE);
        PostOTAStateChangeEvent(DeviceLayer::kOtaDownloadFailed);
        return;
    }

    // Apply the patch and writes that data to the passive partition.
    err = esp_delta_ota_feed_patch(imageProcessor->mDeltaOTAUpdateHandle, blockToWrite.data() + index, blockToWrite.size() - index);
#elif defined(CONFIG_AUTO_UPDATE_RCP) && defined(CONFIG_OPENTHREAD_BORDER_ROUTER)
    err                                    = imageProcessor->ProcessRcpImage(blockToWrite.data(), blockToWrite.size());
#else
    // Get the dummy device handler
    DeviceOTAHandler* handler = OTAManager::GetInstance().GetOTAHandler(DUMMY_DEVICE_ID);
    if (handler != nullptr)
    {
        // For the first block, notify the device that OTA is available
        if (!gOTAStarted)
        {
            OTADeviceEntry entry;
            entry.identifier = DUMMY_DEVICE_ID;
            entry.offset = 0;
            entry.size = 0; // We don't know the size yet
            
            handler->NotifyOTAAvailable(entry);
            gOTAStarted = true;
            ESP_LOGI(TAG, "Notified device %" PRIu32 " of OTA availability", DUMMY_DEVICE_ID);
        }
        
        // Forward the block to the device handler instead of writing to flash
        ESP_LOGI(TAG, "Forwarding OTA block (%zu bytes) to device %" PRIu32, blockToWrite.size(), DUMMY_DEVICE_ID);
        bool success = handler->ProcessBlock(blockToWrite);
        
        if (success)
        {
            // Send ACK for the block
            handler->SendBlockAck(blockToWrite);
            err = ESP_OK;
        }
        else
        {
            ESP_LOGE(TAG, "Failed to process block on device %" PRIu32, DUMMY_DEVICE_ID);
            err = ESP_FAIL;
        }
    }
    else
    {
        ESP_LOGW(TAG, "No handler found for device ID %" PRIu32 ", falling back to normal OTA", DUMMY_DEVICE_ID);
        err = esp_ota_write(imageProcessor->mOTAUpdateHandle, blockToWrite.data(), blockToWrite.size());
    }
#endif // CONFIG_ENABLE_DELTA_OTA

